# # a = [1,60,30,90,100,20,70,59,69,71,80,84]
# # b = 0
# # for i in (a):
# #     if (59 <i):
# #             b = 1
# #     if ( i>=60 and i<70):
# #             b = 2
# #     if ( i>=70 and i < 80 ):
# #             b = 3
# #     if (i >= 80):
# #             b = 4
# #     if (b == 1):
# #          print(i,'是不及格')
# #     elif(b == 2):
# #         print(i, '是及格')
# #     elif (b == 3):
# #          print(i, '是良好')
# #     elif (b == 4):
# #          print(i, '是优秀')
#
#
#
# #成绩0-59不及格，60-70及格 70-80 良好 80以上是优秀    [90,100,81,84]判断下该组成绩是否全部都是优秀
# c = [90,100,81,84,60]
# d = True
# for i in (c):
#     if(i < 80):
#         d = False
# if(d):
#      print(c,"全为优秀")
# else:
#     print(c,'不是全都优秀')

#"01010010001110001001001010101010010101" 计算下几个0 几个1
a = '01010010001110001001001010101010010101'
b = 0
c = 0
for i in (a):
    if(i=="0"):
        b=b+1
    else:
        c=c+1
print("有",b,"个0","有",c,"个1")




