# a 代表变量名，= 是赋值符，表示把右边的值存到左边的变量
# 字符串有4中表示方法 " "    """  """        ' '    '''  '''
a = "dewfreyhtyt"
print(type(a))
print("a的值是"+str(a))
b =1234545
print("b的值是"+str(b))

# [] 表示list，代表是一个列表，可以存多个数据，中间用 ，分开
c = [1,2,3]
print(type(c))
print("c的值是"+str(c))
# ()表示tuple,代表一个元组，中间用 ,分开
d = (1,3,5,89)
print(type(d))
print("d的值是"+str(d))
# {}表示dict,代表一个字典，可以储存多个键值对数据，多个键值对用","隔开，key 和value 用":"隔开
e = {"姓名":"汪芳","手机号":"13817111970"}
print(type(e))
print("e的值是"+str(e))

# 第一组数据   张三,李四,王五,赵六,钱七
a = ["张三","李四","王五","赵六","钱七"]
print("a的值是"+str(a))
# 第二组数据    姓名 张三  年龄 18 性别 女  科目 语文 成绩 80
b = {"姓名":"张三","年龄":18,"性别":"女","科目":"语文","成绩":80}
print("b的值是"+str(b))
# 第三组数据   A，2,3,4,5,6,7,8,9，J,Q,K
c = ["A",2,3,4,5,6,7,8,9,"J","Q","K"]
print("c的值是"+str(c))
# 第四组数据  10000
d = 10000
print("d的值是"+str(d))
# 第五组数据  学生
e = "学生"
print("e的值是"+str(e))
