# #创建新的列表
# a = []
# # 列表最后新增单个值
# a.append("afesgtr")
# print(a)
# #列表合并，形成新的表，原表不变
# b = [1,2,3,4]
# c = ['qe','rt','tg']
# print(a+b+c)
# #表合并，b表中的数据放在a表的末端，a表发生改变
#

# #删
# #根据下标删除某个元素
# a.pop (0)
# print(a)
# #默认删除最后一个元素
# b.pop()
# print(b)
#
# #清空一个列表
# d = [3,4,5,6,7]
# d.clear( )
# print(d)
#
# #改
# e = [1,2,3]
# e[0] = 5
# e[1] = 4
# #等价
# e[0],e[1] = 5,4
# print(e)
#
# #查
# #根据下标查询某个元素
# f = [1,2,3,4,5]
# print(f[0])
# #遍历 借助循环
# for i in f :
#     print(i)

#截取
#截取部分数据
g = 1,2,3,4,5,6,7
print(g[1:3])
# 倒叙
print(g[::-1])
#隔一个取一个
print(g[::2])

#列表的长度
print(len(g))


#成员判断
if (10 in g):
    print('存在列表中')
else:
    print('不存在列表中')